class TestData:

    test_q_text_0 = 'Сколько это стоит? И как оплатить?'
    test_q_text_1 = 'Хочу сразу несколько самокатов! Так можно?'
    test_q_text_2 = 'Как рассчитывается время аренды?'
    test_q_text_3 = 'Можно ли заказать самокат прямо на сегодня?'
    test_q_text_4 = 'Можно ли продлить заказ или вернуть самокат раньше?'
    test_q_text_5 = 'Вы привозите зарядку вместе с самокатом?'
    test_q_text_6 = 'Можно ли отменить заказ?'
    test_q_text_7 = 'Я жизу за МКАДом, привезёте?'

    e_answer = [
        ('Сутки — 400 рублей. Оплата курьеру — наличными или картой.'),
        ('Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'),
        ('Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'),
        ('Только начиная с завтрашнего дня. Но скоро станем расторопнее.'),
        ('Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'),
        ('Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'),
        ('Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'),
        ('Да, обязательно. Всем самокатов! И Москве, и Московской области.')
     ]

    person_1 = ["Шрек", "Грязевич", "Болото, 1", "Домодедовская", "79113942002", "14.08.2025", "Оставить у двери и не беспокоить"]
    person_2 = ["Дед", "Мороз", "Север, 24", "Люблино", "79112762002", "23.09.2025", "Когда уже начнется лето в этом году?"]
